"use client";
import { useState } from "react";
import React from "react";
interface Tab {
  title: string;
  content: string;
}

const tabs: Tab[] = [
  {
    title: "Фатиха",
    content: `Ағузу биллаһи минәш шайтанир-ражим.
Бисмиллаһир рахманир рахиим
әлхәмду лилләһи раббил ъаләмиин
әррахманир рахиим
мәлики йәумид диин
иййәкә нәъбуду уә иййәкә нәстәъиин
иҳдинәс сирәтал мустәқиим
сирәтал ләз̃иинә әнъамтә ъаләйһим ғайрил мәғдууби ъаләйһим уәләд дооооооллиин
(Әмин).

(Әмин әр уақытта іштен айтылады).

Перевод:
Во имя Аллаха, Милостивого, Милосердного.
Хвала Аллаху, Господу миров.
Милостивому, Милосердному.
Властелину дня воздаяния.
Тебе одному мы поклоняемся и Тебя одного просим о помощи.
Веди нас прямым путём,
Путём тех, кого Ты облагодетельствовал, не тех, кто заслужил гнев, и не заблудших.
(Амин).`
  },
  {
    title: "Ықылас (3 рет)",
    content: `Биисмиллаһир рахманир рахим.
Қуль һуа аллаһу ахад.
Аллаһус сомад.
Ләм йалид уа ләм йуләд.
Уа ләм йакуль ләһу куфуән ахад.

(3 рет)

Перевод:
Скажи: Он — Аллах, Един.
Аллах — Вечный, Самодостаточный.
Он не рожден и не рождает,
И нет равного Ему.`
  },
  {
    title: "Бата",
    content: `Садақал-лаһул-азыйм.
Субхана роббикә роббил ғиззати ғамма ясифун
Уа саламун 'алал-мұрсалин
Уалхамду-лиллаһи роббил 'аламиин.

Иә, ұлы Алла осы дұғалармен барлық марқұмдардың рухына мейірімін төгіп, оларды қабір азабынан қорғап, оларға жәннәт қақпаларын ашсын!`
  },
  {
    title: "Дуа",
    content: `Иә, ұлы Алла осы оқылған "Фатиха", "Ықылас" сүресінен болған сауапты Адам ата мен Хауа анаға, Пайғамбарымыз Мұхаммед (салаллаһу ьәләйһи уә сәлламға),барша дүниеден өткен пайғамбарларға, сахабаларға, шәһидтерге, дүниеден өткен барша мұсылмандарға, өзімнің дүниеден өткен ата-бабаларыма, әке-шешелеріме, туған-туысқандарыма (аты-жөнiн айту керек) бағыштадым.

Иә, Алла! Ол кісілердің рухтарын осы оқылған құран аяттарымен нұрландырып, қабiр азабынан сақтап, жандарын Жәннәттық ете көр! Бұл дүниеде біліп-білмей істеген күнәларын кешіре көр! Иә,Жаратқан Ием, ақірет күні ол кісілердің амал кітаптарының оң жақтан болуына нәсіп ете көр! Раббанаа аатинаа фид-дуния һасанатан. уа фил аахирати һасанатан. уақинаа ғазаабан-наар. Әумин!`
  }
];


const Dua = () => {
const [active, setActive] = useState(0);
  return (
    <>
        <div className="flex flex-col gap-5 items-center mt-15 ">
            <span className='text-4xl text-[#48887B]'>Құран бағыштап үйреніңіз</span>
            <span className='text-2xl text-gray-400'>Передайте вознаграждение (саваб) умершему</span>
        </div>
        <div className="max-w-7xl mx-auto my-10 p-6 bg-white rounded-xl shadow-md dark:bg-gray-800">
      <div className="flex justify-center mb-6 space-x-3 flex-wrap ">
        {tabs.map((tab, i) => (
          <button
            key={i}
            onClick={() => setActive(i)}
            className={`px-5 py-2 rounded-t-lg font-medium text-lg ${
              active === i
                ? "bg-[#48887B] text-white shadow-lg"
                : "bg-gray-200 text-gray-700 hover:bg-gray-300 "
            }`}
          >
            {tab.title}
          </button>
        ))}
      </div>
      <div className="border rounded-b-lg p-6 bg-gray-50 whitespace-pre-line text-lg leading-relaxed dark:bg-gray-800">
        {tabs[active].content}
      </div>
    </div>
    </>
  )
}

export default Dua